#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.networking_itn.azurerm_nat_gateway.this[1] will be created
  + resource "azurerm_nat_gateway" "this" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "italynorth"
      + name                    = "io-p-itn-ng-02"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "2",
        ]
    }

  # module.networking_itn.azurerm_nat_gateway.this[2] will be created
  + resource "azurerm_nat_gateway" "this" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "italynorth"
      + name                    = "io-p-itn-ng-03"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "3",
        ]
    }

  # module.networking_itn.azurerm_nat_gateway_public_ip_association.this_pip_01[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_nat_gateway_public_ip_association" "this_pip_01" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/natGateways/io-p-itn-ng-01|/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/publicIPAddresses/io-p-itn-ng-pip-01" -> null
      - nat_gateway_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/natGateways/io-p-itn-ng-01" -> null
      - public_ip_address_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/publicIPAddresses/io-p-itn-ng-pip-01" -> null
    }

  # module.networking_itn.azurerm_nat_gateway_public_ip_prefix_association.this_ippres[0] will be created
  + resource "azurerm_nat_gateway_public_ip_prefix_association" "this_ippres" {
      + id                  = (known after apply)
      + nat_gateway_id      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/natGateways/io-p-itn-ng-01"
      + public_ip_prefix_id = (known after apply)
    }

  # module.networking_itn.azurerm_nat_gateway_public_ip_prefix_association.this_ippres[1] will be created
  + resource "azurerm_nat_gateway_public_ip_prefix_association" "this_ippres" {
      + id                  = (known after apply)
      + nat_gateway_id      = (known after apply)
      + public_ip_prefix_id = (known after apply)
    }

  # module.networking_itn.azurerm_nat_gateway_public_ip_prefix_association.this_ippres[2] will be created
  + resource "azurerm_nat_gateway_public_ip_prefix_association" "this_ippres" {
      + id                  = (known after apply)
      + nat_gateway_id      = (known after apply)
      + public_ip_prefix_id = (known after apply)
    }

  # module.networking_itn.azurerm_public_ip.this_01[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_public_ip" "this_01" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/publicIPAddresses/io-p-itn-ng-pip-01" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "4.232.130.16" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "italynorth" -> null
      - name                    = "io-p-itn-ng-pip-01" -> null
      - resource_group_name     = "io-p-itn-common-rg-01" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        } -> null
      - zones                   = [
          - "1",
        ] -> null
    }

  # module.networking_itn.azurerm_public_ip_prefix.ng[0] will be created
  + resource "azurerm_public_ip_prefix" "ng" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "italynorth"
      + name                = "io-p-itn-ng-ippre-01"
      + prefix_length       = 31
      + resource_group_name = "io-p-itn-common-rg-01"
      + sku                 = "Standard"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones               = [
          + "1",
        ]
    }

  # module.networking_itn.azurerm_public_ip_prefix.ng[1] will be created
  + resource "azurerm_public_ip_prefix" "ng" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "italynorth"
      + name                = "io-p-itn-ng-ippre-02"
      + prefix_length       = 31
      + resource_group_name = "io-p-itn-common-rg-01"
      + sku                 = "Standard"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones               = [
          + "2",
        ]
    }

  # module.networking_itn.azurerm_public_ip_prefix.ng[2] will be created
  + resource "azurerm_public_ip_prefix" "ng" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "italynorth"
      + name                = "io-p-itn-ng-ippre-03"
      + prefix_length       = 31
      + resource_group_name = "io-p-itn-common-rg-01"
      + sku                 = "Standard"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones               = [
          + "3",
        ]
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.networking_itn.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking_itn.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
